Repository: Ranchero-Software/NetNewsWire
Catalog: Mac/Inspector/*.lproj/Inspector.strings
Languages: es

# 5oG-0x-T8O.title
source: Multiple selection
es: Selección múltiple

# Bw5-c7-yDX.title
source: Show notifications for new articles
es: Mostrar notificaciones para artículos nuevos

# Fdj-2F-Kl1.title
source: Nothing to inspect
es: Nada a inspeccionar

# Fg8-rA-G5J.title
source: Home Page
es: Página principal

# Xl3-7D-9Mw.title
source: Folder Name Field
es: Carpeta Nombre Campo

# aRe-yV-R0h.title
source: Always use Reader view
es: Siempre usar vista de lectura

# iLD-8q-EAJ.title
source: Nothing to inspect
es: Nada a inspeccionar

# sfH-oR-GXm.title
source: Feed
es: Fuente

# tAO-GI-MT1.title
source: Feed Name Field
es: Fuente Nombre Campo

# ye3-co-8lc.title
source: Builtin Smart Feed
es: Fuente inteligente

# ylq-Dz-pnT.title
source: Folder
es: Carpeta

# zzB-rX-1dK.title
source: Feed
es: Fuente
