{"description": "I just said what I said and it was wrong. Or was taken wrong.", "feed_url": "http://leancrew.com/all-this/feed.json", "title": "And now it’s all this", "items": [{"title": "Last thoughts on modifier keys", "url": "http://leancrew.com/all-this/2017/11/last-thoughts-on-modifier-keys/", "author": {"name": "Dr. Drang"}, "summary": "The first shall be last.", "date_published": "2017-11-23T21:08:29+00:00", "id": "http://leancrew.com/all-this/2017/11/last-thoughts-on-modifier-keys/", "content_html": "<p>When I wrote the post about <a href=\"http://leancrew.com/all-this/2017/11/modifier-key-order/\">ordering Mac modifier keys</a> a few days ago, I was thinking primarily about the proper order of the <em>symbols</em> when writing about a keyboard shortcut, like ⌃⌥⌘P.<sup id=\"fnref:preview\"><a href=\"#fn:preview\" rel=\"footnote\">1</a></sup>. I mentioned parenthetically that this order isn’t always observed when people speak about keyboard shortcuts or when they write the names of the keys out fully, as in “Command-Shift-3 takes a screenshot.”</p>\n<p>Jason Snell, in both <a href=\"https://sixcolors.com/link/2017/11/the-order-of-modifier-keys-on-the-mac/\">a post at Six Colors</a> and in conversation with John Siracusa on <a href=\"https://www.relay.fm/upgrade/168\">the lastest episode of Upgrade</a>, took a stand against Apple’s ordering:<sup id=\"fnref:hig\"><a href=\"#fn:hig\" rel=\"footnote\">2</a></sup></p>\n<blockquote>\n<p>Command is the commander! Command is the monarch of all keys! Command always comes first, in my book.</p>\n</blockquote>\n<p>Siracusa agreed, and so do I. The ⌘ key is, and has always been, the key that signals a keyboard shortcut. While other modifier keys are sometimes used without ⌘—in cursor control and text selection, for example—I can’t think of any Apple applications that don’t use ⌘ to signal a keyboard shortcut for a menu item. And that primacy in shortcuts to menu items is, I think, why Apple puts it last rather than first.</p>\n<p>Keyboard shortcuts are always presented right-justified along the right edge of the menu. The most common shortcuts are just ⌘ and a letter, like ⌘N to start a new document, for example. It’s typically the variations on the basic command that get additional modifier keys, like ⌥⌘N to start a new project. If that were presented in a menu as ⌘⌥N, the menu would look wrong because the ⌘ symbols wouldn’t line up.</p>\n<p>Here’s the <span class=\"menu\">File</span> menu in Safari:</p>\n<p><img alt=\"Safari File menu\" class=\"ss\" src=\"http://leancrew.com/all-this/images2017/20171123-Safari%20File%20menu.png\" title=\"Safari File menu\"/></p>\n<p>There are two different <span class=\"menu\">New</span> commands and three different <span class=\"menu\">Close</span> commands. This, in Apple’s opinion (and mine), wouldn’t be right:</p>\n<p><img alt=\"Altered Safari File menu\" class=\"ss\" src=\"http://leancrew.com/all-this/images2017/20171123-Altered%20Safari%20File%20menu.png\" title=\"Altered Safari File menu\"/></p>\n<p>It’s not just having the ⌘ symbols aligned. The additional modifier symbols go in front <em>because</em> ⌘ is king and must sit next to the N or the W. The importance of the modifier decreases as you move away from the letter.</p>\n<p>It should go without saying—but I’ll say it anyway—that the letter (or number or whatever) key is the most important because <em>nothing</em> happens until it’s pressed.</p>\n<p>Having said all this, and despite agreeing with Apple’s symbol ordering, my ear for shortcut ordering works just like Jason’s and John’s. The main reason I use keyboard shortcut symbols in my posts instead of words is that I can read ⌥⇧⌘W and not be bothered because I don’t “hear” it as I read the symbols. “Option-Shift-Command-W,” on the other hand, gets sounded out in my head, and it sounds wrong.</p>\n<p>I suspect that’s why Apple’s own documentation sometimes gets the order wrong when the modifiers get written out as words. In speaking out the keys, “Command” is natural to put first because it announces that what’s coming is a keyboard shortcut.</p>\n<div class=\"footnotes\">\n<hr/>\n<ol>\n<li id=\"fn:preview\">\n<p>Which happens to be the shortcut I use for previewing a blog post locally before publishing it. <a href=\"#fnref:preview\" rev=\"footnote\">↩︎</a></p>\n</li>\n<li id=\"fn:hig\">\n<p>In the original post, I said I didn’t know where the order was documented. A few people pointed me to both the <a href=\"https://developer.apple.com/macos/human-interface-guidelines/user-interaction/keyboard/\">Human Interface Guidelines</a> and the <a href=\"https://itunes.apple.com/us/book/apple-style-guide/id1161855204?mt=11\">Style Guide</a>, where Apple gives the proper order explicitly. <a href=\"#fnref:hig\" rev=\"footnote\">↩︎</a></p>\n</li>\n</ol>\n</div><br />\n<p>[If the formatting looks odd in your feed reader, <a href=\"http://leancrew.com/all-this/2017/11/last-thoughts-on-modifier-keys/\">visit the original article</a>]</p>"}, {"title": "My next Mac", "url": "http://leancrew.com/all-this/2017/11/my-next-mac/", "author": {"name": "Dr. Drang"}, "summary": "Apple isn't making it easy to choose a Mac and hasn't for a few years.", "date_published": "2017-11-22T22:04:57+00:00", "id": "http://leancrew.com/all-this/2017/11/my-next-mac/", "content_html": "<p>Will probably be an iMac. I guess that spoils the suspense, doesn’t it?</p>\n<p>My iMac at work is the <a href=\"https://support.apple.com/kb/sp667?locale=en_US\">27″ Late 2012 model</a>, the one that came out one step before Retina came to the iMac. I don’t regret buying it, as my previous iMac (a <a href=\"https://everymac.com/systems/apple/imac/specs/imac-core-2-duo-2.16-24-inch-specs.html\">2006 model</a>, I think) was absolutely on its last legs—constantly swapping to hard disk and running hot. I hadn’t meant to wait so long to replace it, but there was <a href=\"https://buyersguide.macrumors.com/\">a long delay</a> before that 2012 model came out, and I didn’t want to buy something that would be last year’s model almost as soon as I set it up.</p>\n<p>My home Mac is the venerable 2010 13″ MacBook Air, the first good Air. In the normal course of things, this would be the Mac I replace next, and I’ve been expecting to do so for a few years now. but…</p>\n<p>But Apple never came out with a Retina MacBook Air, choosing instead to go with the MacBook, which I find a little too far on the portable side of the portability/power spectrum. A couple of years ago, I had a crisis when <a href=\"http://leancrew.com/all-this/2015/06/beep-beep-beep/\">my Air crapped out on me</a>. It seemed wrong to put money into a five-year-old machine, but I wasn’t enthused about any of the MacBooks in the lineup at the time. I didn’t know the just-released 2015 MacBook Pro would turn out to be the <a href=\"https://marco.org/2017/11/14/best-laptop-ever\">best laptop ever made</a>, I didn’t want to spend MacBook Pro money on my home/travel machine.</p>\n<p>The $280 logic board upgrade turned out to be a good investment, as I’m now 2½ years into my rejuvenated Air. Yes, it takes a while to wake up when I open the lid. Yes, its 128 GB SSD is tiny. No, it can’t take advantage of many of the iOS integration features that newer Macs can. And no, I don’t think it’s a good idea to install High Sierra on it. But it’s given me 30 months of faithful use, much more than I expected at the time.</p>\n<p>The announcement of the Touch Bar last year made me certain I’d be getting a MacBook Pro with it. A software-configurable set of controls seemed perfect for someone who’s always ginning up little scripts. But no one seems to like it, possibly because its configurability isn’t especially open to users. Bummer.</p>\n<p>I’ve delayed the decision on my home Mac for such a long time that now my office Mac is long in the tooth, too. Still working fine for most tasks, but just a Core 2 Duo machine that often <a href=\"http://leancrew.com/all-this/2015/10/dealing-with-a-recalcitrant-pdf/\">makes me wait</a> to scroll through long PDFs of scanned engineering and architectural drawings, something I need to do at work quite often. And no Retina.</p>\n<p>So it looks like my best bet is to buy a new iMac for work and bring my current office iMac home. This will put the power where I need it the most and will give me extra ooomph here at home. Especially with disk space (3 TB vs. 128 GB) and RAM (24GB vs. 4GB).</p>\n<p>It will be weird, though, as I haven’t had a desktop computer here at home in a dozen years. Will I enjoy being tethered to one spot in the house? And what about a travel computer?</p>\n<p>Both of these questions are made less pressing by the device I’m typing this on: a 9.7″ iPad Pro. While I agree with <a href=\"http://www.macdrifter.com/2017/11/the-mac-still-feels-like-home.html\">Gabe</a> that it is by no means a Mac substitute, it can handle a lot of what I do at home and virtually everything I need to do on the road.<sup id=\"fnref:gabe\"><a href=\"#fn:gabe\" rel=\"footnote\">1</a></sup></p>\n<p>As for which iMac, I think I’ll settle on a middle-of-the-road 27″ configuration with a 3TB Fusion drive. Sort of the 2017 of what I bought in 2012.</p>\n<div class=\"footnotes\">\n<hr/>\n<ol>\n<li id=\"fn:gabe\">\n<p>I bought the iPad Pro last year as a sort of experiment to find out how comfortable I’d be working on it. I intend to write a full post about the results of that experiment soon, but in the meantime, you really should read <a href=\"http://www.macdrifter.com/2017/11/the-mac-still-feels-like-home.html\">Gabe’s post over at Macdrifter</a>. I’ll probably use his post as a jumping-off point. And there may be a quiz. <a href=\"#fnref:gabe\" rev=\"footnote\">↩︎</a></p>\n</li>\n</ol>\n</div><br />\n<p>[If the formatting looks odd in your feed reader, <a href=\"http://leancrew.com/all-this/2017/11/my-next-mac/\">visit the original article</a>]</p>"}, {"title": "Modifier key order", "url": "http://leancrew.com/all-this/2017/11/modifier-key-order/", "author": {"name": "Dr. Drang"}, "summary": "Writing about Mac keyboard shortcuts? Make sure you put them in canonical order.", "date_published": "2017-11-20T02:22:59+00:00", "id": "http://leancrew.com/all-this/2017/11/modifier-key-order/", "content_html": "<p>If you write about Mac keyboard shortcuts, as I did yesterday, you should know how to do it right. Just as there’s a <a href=\"https://dictionary.cambridge.org/grammar/british-grammar/adjectives-order\">proper order for adjectives</a> in English, there’s a proper order for listing the modifier keys in a shortcut.</p>\n<p>I haven’t found any documentation for this, but Apple’s preferred order is clear in how they show the modifiers in menus and how they’re displayed in the Keyboard Shortcuts Setting.</p>\n<p><img alt=\"Canonical Mac modifier key order\" class=\"ss\" src=\"http://leancrew.com/all-this/images2017/20171119-Canonical%20Mac%20modifier%20key%20order.png\" title=\"Canonical Mac modifier key order\"/></p>\n<p>The order is similar to how you see them down at the bottom left of your keyboard.</p>\n<p><img alt=\"Modifier keys\" class=\"ss\" src=\"http://leancrew.com/all-this/images2017/20171119-Modifier%20keys.jpg\" title=\"Modifier keys\"/></p>\n<p>Control (⌃), Option (⌥), and Command (⌘) always go in that order. The oddball is the Shift(⇧) key, which sneaks in just in front of  Command.</p>\n<p>Keyboard Maestro recognizes this standard order and presents its “hot key” shortcut the same way.</p>\n<p><img alt=\"Keyboard Maestro hot key field\" class=\"ss\" src=\"http://leancrew.com/all-this/images2017/20171119-Keyboard%20Maestro%20hot%20key%20field.png\" title=\"Keyboard Maestro hot key field\"/></p>\n<p>(When people speak about keyboard shortcuts, it’s not uncommon to put Command first, e.g., “Command-Shift-3 takes a screenshot.” I’ve seen it written out that way, too. Apple is usually pretty careful to use the same order when using words as when using symbols.  <a href=\"https://support.apple.com/en-us/HT201361\">This page</a>, for example, uses “Shift-Command-3,” to match the ⇧⌘3 you’d see in the Keyboard Shortcut Setti
