Repository: Ranchero-Software/NetNewsWire
Catalog: iOS/Resources/*.lproj/Localizable.strings
Languages: es, zh_hans

# action.title.cancel
source: Cancel
es: Cancelar
zh_hans: 取消

# action.title.delete
source: Delete
es: Borrar
zh_hans: 删除

# action.title.more
source: More
es: Más
zh_hans: 更多

# action.title.rename
source: Rename
es: Renombrar
zh_hans: 重命名

# actionsheet.title.choose-opml-destination
source: Choose an account to receive the imported feeds and folders
es: Escoge una cuenta para recibir las fuentes y carpetas importadas
zh_hans: 选择一个带有要导出订阅的账户

# actionsheet.title.choose-opml-export-account
source: Choose an account with the subscriptions to export
es: Escoge una cuenta con las suscripciones a exportar
zh_hans: 选择一个带有要导出的订阅的帐户。

# activity.title.find-in-article.titlecase
source: Find in Article
es: Buscar en artículo
zh_hans: 在文章中查找

# activity.title.open-in-browser
source: Open in Browser
es: Abrir en navegador
zh_hans: 在浏览器中打开

# alert.message.author-website.%@
source: Author's website: %@
es: Página web del autor: %@
zh_hans: 作者网站： %@

# alert.message.cannot-undo-action
source: This action cannot be undone.
es: No puedes deshacer esta acción.
zh_hans: 此操作无法撤销。

# alert.message.delete-feed.%@
source: Are you sure you want to delete the “%@” feed?
es: ¿Estás seguro que quieres borrar la fuente “%@”?
zh_hans: 你确定要删除“%@”吗？

# alert.message.delete-folder.%@
source: Are you sure you want to delete the “%@” folder?
es: ¿Estás seguro que quieres borrar la carpeta “%@”?
zh_hans: 你确定要删除文件夹“%@”吗？

# alert.message.device-cannot-send-email
source: This device cannot send emails.
es: Este dispositivo no puede enviar correos electrónicos.
zh_hans: 此设备无法发送电子邮件。

# alert.message.duplicate-theme.%@
source: The theme “%@” already exists. Overwrite it?
es: El tema “%@” ya existe. ¿Sobreescribir?
zh_hans: 主题“%@”已经存在。是否覆盖？

# alert.message.exit-full-screen
source: To exit Full Screen mode tap the top of the screen. You'll only see this message once.
es: Para salir del modo a pantalla completa presiona la parte de arriba de la pantalla. Sólo verás este mensaje una vez.
zh_hans: 请点击屏幕顶部以退出全屏。 此消息只会出现一次。

# alert.message.import-theme.%@.%@
source: Are you sure you want to import “%@” by %@?
es: Estás seguro de importar “%@” por %@?
zh_hans: 你确定要导入由 %2$@ 创作的“%1$@”吗？

# alert.message.imported-theme-successfully.%@
source: The theme “%@” has been imported.
es: El tema “%@” ha sido importado.
zh_hans: 主题“%@”已导入。

# alert.message.markasread.turnoffconfirmation
source: You can turn off this confirmation in Settings.
es: Puedes desactivar esta confirmación en los ajustes.
zh_hans: 你可以在设置中关闭此确认提示。

# alert.message.opml-import-success.%@
source: Subscriptions have been imported to your “%@“ account.
es: Las suscripciones han sido importadas en tu cuenta “%@“.
zh_hans: 订阅已导入到你的 %@ 账户。

# alert.message.opml.opml-export-success
source: Your subscriptions have been exported successfully.
es: Tus suscripciones han sido exportadas con éxito.
zh_hans: 你的订阅已成功导出。

# alert.message.theme-data-corrupted.%@
source: This theme cannot be used because of data corruption in the Info.plist. %@.
es: Este tema no puede ser activado por un error de corrupción de datos en Info.plist. %@.
zh_hans: 由于 Info.plist 中的数据损坏，无法使用此主题。%@。

# alert.message.theme-installed.%@
source: The theme “%@” has been installed.
es: El tema “%@” ha sido instalado.
zh_hans: 已安装主题“%@”。

# alert.message.theme-key-missing.%@
source: This theme cannot be used because the the key—“%@”—is not found in the Info.plist.
es: Este tema no puede ser usado porque la key—“%@”—no se encuentra en el archivo Info.plist.
zh_hans: 无法使用此主题，因为在 Info.plist 中找不到键“%@”。

# alert.message.theme-type-mismatch.%@
source: This theme cannot be used because the the type—“%@”—is mismatched in the Info.plist.
es: Este tema no puede ser usado porque el tipo—“%@”—no coincide en el archivo Info.plist
zh_hans: 无法使用此主题，因为在 Info.plist 中类型“%@”不匹配。

# alert.message.theme-value-missing.%@
source: This theme cannot be used because the the value—“%@”—is not found in the Info.plist.
es: Este tema no puede ser usado porque el valor—“%@”—no se encuentra en el archivo Info.plist.
zh_hans: 无法使用此主题，因为在 Info.plist 中找不到值“%@”。

# alert.title.deactivate-extension.%@
source: Are you sure you want to deactivate “%@“?
es: ¿Estás seguro que quieres desactivar “%@“?
zh_hans: 你确定要停用“%@”吗？

# alert.title.delete-folder
source: Delete Folder
es: Borrar carpeta
zh_hans: 删除文件夹

# alert.title.delete-theme.%@
source: Are you sure you want to delete “%@”?
es: Estás seguro que quieres borrar “%@”?
zh_hans: 你确定要删除“%@”吗？

# alert.title.duplicate-theme
source: Duplicate Theme
es: Duplicar tema
zh_hans: 重复的主题

# alert.title.error
source: Error
zh_hans: 错误

# alert.title.exit-full-screen
source: Exit Full Screen
es: Salir de pantalla completa
zh_hans: 退出全屏

# alert.title.import-theme
source: Import Theme
es: Importar tema
zh_hans: 导入主题

# alert.title.imported-theme-succesfully
source: Imported Successfully
es: Importado con éxito
zh_hans: 导入成功

# alert.title.install-theme
source: Install Theme
es: Instalar tema
zh_hans: 安装主题

# alert.title.install-theme.%@.%@
source: Install theme “%@” by %@?
es: Instalar tema “%@” por %@?
zh_hans: 安装由 %2$@ 创作的“%@”主题？

# alert.title.markasread
source: Mark As Read
es: Marcar como leído
zh_hans: 标为已读

# alert.title.opml.opml-export-success
source: Exported Successfully
es: Exportado con éxito
zh_hans: 导出成功

# alert.title.opml.opml-import-success
source: Imported Successfully
es: Importado con éxito
zh_hans: 导入成功

# alert.title.remove-account.%@
source: Are you sure you want to remove “%@“?
es: ¿Estás seguro que quieres borrar “%@“?
zh_hans: 你确定要重命名“%@”吗？

# alert.title.rename-feed.%@
source: Rename “%@”
es: Renombrar “%@”
zh_hans: 重命名“%@”

# alert.title.theme-installed
source: Theme Installed
es: Tema instalado
zh_hans: 主题已安装

# appdefaults.colorpalette.automatic
source: Automatic
es: Automático
zh_hans: 自动

# appdefaults.colorpalette.dark
source: Dark
es: Oscuro
zh_hans: 深色

# appdefaults.colorpalette.light
source: Light
es: Claro
zh_hans: 浅色

# button.accessibility.title.error-readerview
source: Error - Reader View
es: Error - Vista de lectura
zh_hans: 错误 - 阅读器视图

# button.accessibility.title.processing-readerview
source: Processing - Reader View
es: Procesando - Vista de lectura
zh_hans: 处理中 - 阅读器视图

# button.accessibility.title.readerview
source: Reader View
es: Vista de lectura
zh_hans: 阅读器视图

# button.accessibility.title.selected-readerview
source: Selected - Reader View
es: Seleccionado - Vista de lectura
zh_hans: 已选择 - 阅读器视图

# button.title.about
source: About
es: Acerca de
zh_hans: 关于

# button.title.activate-account
source: Activate Account
es: Activar cuenta
zh_hans: 启用账户

# button.title.add-account
source: Add Account
es: Añadir cuenta
zh_hans: 添加账户

# button.title.add-folder
source: Add Folder
es: Añadir carpeta
zh_hans: 新建文件夹

# button.title.add-item
source: Add Item
es: Añadir item
zh_hans: 添加项目

# button.title.add-reddit-feed
source: Add Reddit Feed
zh_hans: 添加 Reddit 订阅

# button.title.add-web-feed
source: Add Web Feed
es: Añadir fuente
zh_hans: 添加 Web 订阅

# button.title.addtwitterfeed
source: Add Twitter Feed
zh_hans: 添加 Twitter 订阅

# button.title.always-use-reader-view
source: Always Use Reader View
es: Siempre usar vista de lectura
zh_hans: 总是使用阅读器视图

# button.title.artice-themes
source: Article Themes
es: Temas de artículo
zh_hans: 文章主题

# button.title.cancel
source: Cancel
es: Cancelar
zh_hans: 取消

# button.title.close
source: Close
es: Cerrar
zh_hans: 关闭

# button.title.copy-article-url
source: Copy Article URL
es: Copiar URL de artículo
zh_hans: 拷贝文章 URL

# button.title.copy-external-url
source: Copy External URL
es: Copiar URL externa
zh_hans: 拷贝外部 URL

# button.title.copy-feed-url
source: Copy Feed URL
es: Copiar URL de fuente
zh_hans: 拷贝订阅源 URL

# button.title.copy-home-pageurl
source: Copy Home Page URL
es: Copiar URL de página de inicio
zh_hans: 拷贝主页 URL

# button.title.credentials
source: Credentials
es: Credenciales
zh_hans: 凭证

# button.title.deactivate
source: Deactivate
es: Desactivar
zh_hans: 停用

# button.title.deactivate-account
source: Deactivate Account
es: Desactivar cuenta
zh_hans: 停用账户

# button.title.deactivate-extension
source: Deactivate Extension
es: Desactivar extensión
zh_hans: 停用扩展

# button.title.default
source: Default
es: Por defecto
zh_hans: 默认

# button.title.delete
source: Delete
es: Borrar
zh_hans: 删除

# button.title.delete-feed
source: Delete Feed
es: Borrar fuente
zh_hans: 删除订阅

# button.title.delete-theme
source: Delete Theme
es: Borrar Theme
zh_hans: 删除主题

# button.title.dismiss
source: Dismiss
es: Ignorar
zh_hans: 关闭

# button.title.display-and-behaviors
source: Display & Behaviors
es: Aspecto y comportamiento
zh_hans: 显示和体验

# button.title.done
source: Done
es: Hecho
zh_hans: 完成

# button.title.enable-extension
source: Enable Extension
es: Activar extensión
zh_hans: 启用扩展

# button.title.export-subscriptions
source: Export Subscriptions
es: Exportar suscripciones
zh_hans: 导出订阅

# button.title.full-screen
source: Full Screen
es: Pantalla completa
zh_hans: 全屏

# button.title.get-info
source: Get Info
es: Obtener información
zh_hans: 获取信息

# button.title.go-to-feed
source: Go To Feed
es: Ir a la fuente
zh_hans: 前往订阅

# button.title.go-to-feed.titlecase
source: Go to Feed
es: Ir a la fuente
zh_hans: 前往订阅

# button.title.import-subscriptions
source: Import Subscriptions
es: Importar suscripciones
zh_hans: 导入订阅

# button.title.import-theme
source: Import Theme
es: Importar tema
zh_hans: 导入主题

# button.title.manage-accounts
source: Manage Accounts
es: Gestionar cuentas
zh_hans: 管理账户

# button.title.manage-extensions
source: Manage Extensions
es: Gestionar extensiones
zh_hans: 管理扩展

# button.title.mark-above-as-read.titlecase
source: Mark Above as Read
es: Marcar anteriores como leídos
zh_hans: 将上方文章标为已读

# button.title.mark-all-as-read
source: Mark All as Read
es: Marcar todo como leído
zh_hans: 全部标为已读

# button.title.mark-all-as-read.%@
source: Mark All as Read in “%@“
es: Marcar todo como leído en “%@“
zh_hans: 将“%@”中的文章全部标为已读

# button.title.mark-all-as-read.titlecase
source: Mark All as Read
es: Marcar todo como leído
zh_hans: 全部标为已读

# button.title.mark-article-unread
source: Mark Article Unread
es: Marcar artículo como no leído
zh_hans: 将文章标为未读

# button.title.mark-as-read.titlecase
source: Mark as Read
es: Marcar como leído
zh_hans: 标为已读

# button.title.mark-as-starred.titlecase
source: Mark as Starred
es: Marcar como favorito
zh_hans: 星标

# button.title.mark-as-unread.titlecase
source: Mark as Unread
es: Marcar como no leído
zh_hans: 标为未读

# button.title.mark-as-unstarred.titlecase
source: Mark as Unstarred
es: Marcar como no favorito
zh_hans: 取消星标

# button.title.mark-below-as-read.titlecase
source: Mark Below as Read
es: Marcar siguientes como leído
zh_hans: 将下方文章标为已读

# button.title.more
source: More
es: Más
zh_hans: 更多

# button.title.netnewswire-help
source: NetNewsWire Help
es: Ayuda de NetNewsWire
zh_hans: NetNewsWire 帮助

# button.title.netnewswire-website
source: NetNewsWire Website
es: Página web de NetNewsWire
zh_hans: NetNewsWire 官网

# button.title.new-article-notifications
source: New Article Notifications
es: Notificaciones de nuevos artículos
zh_hans: 新文章通知

# button.title.next
source: Next
es: Siguiente
zh_hans: 下一个

# button.title.next-article
source: Next Article
es: Siguiente artículo
zh_hans: 新文章

# button.title.next-result
source: Next Result
es: Siguiente artículo
zh_hans: 下一个结果

# button.title.next-unread-article
source: Next Unread Article
es: Siguiente artículo no leído
zh_hans: 下一个未读文章

# button.title.open-home-page
source: Open Home Page
es: Abrir página web
zh_hans: 打开主页

# button.title.open-in-browser
source: Open In Browser
es: Abrir en navegador
zh_hans: 在浏览器中打开

# button.title.open-settings
source: Open Settngs
es: Abrir ajustes
zh_hans: 打开设置

# button.title.open-system-settings
source: Open System Settings
es: Abrir ajustes del sistema
zh_hans: 打开系统设置

# button.title.overwrite
source: Overwrite
es: Sobreescribir
zh_hans: 覆盖

# button.title.overwrite-theme
source: Overwrite Theme
es: Sobreescribir tema
zh_hans: 覆盖主题

# button.title.previous-article
source: Previous Article
es: Artículo anterior
zh_hans: 上一篇文章

# button.title.previous-result
source: Previous Result
es: Resultado anterior
zh_hans: 上一个结果

# button.title.remove-account
source: Remove Account
es: Borrar cuenta
zh_hans: 移除账户

# button.title.rename
source: Rename
es: Renombrar
zh_hans: 重命名

# button.title.selected-mark-article-unread
source: Selected - Mark Article Unread
es: Seleccionado - Marcar artículo como no leído
zh_hans: 已选择 - 标记文章为未读

# button.title.selected-star-article
source: Selected - Star Article
es: Seleccionado - Marcar como favorito
zh_hans: 已选择 - 星标文章

# button.title.share
source: Share
es: Compartir
zh_hans: 共享

# button.title.show-feed-article
source: Show Feed Article
es: Mostrar artículo de fuente
zh_hans: 显示订阅文章

# button.title.show-reader-view
source: Show Read View
es: Mostrar vista de lectura
zh_hans: 显示阅读器视图

# button.title.show-website
source: Show Website
es: Mostrar página web
zh_hans: 显示网站

# button.title.star
source: Star
es: Favorito
zh_hans: 星标

# button.title.star-article
source: Star Article
es: Artículo favorito
zh_hans: 星标文章

# button.title.timeline-layout
source: Timeline Layout
es: Disposición de la línea de tiempo
zh_hans: 时间线布局

# button.title.unstar
source: Unstar
es: Quitar favorito
zh_hans: 取消星标

# button.title.update-credentials
source: Update Credentials
es: Actualizar credenciales
zh_hans: 更新凭证

# button.title.use-cloudkit
source: Use iCloud
es: Utilizar iCloud
zh_hans: 使用 iCloud

# errordescription.localized.communication-failure
source: Unable to communicate with NetNewsWire.
es: Imposible comunicarse con NetNewsWire.
zh_hans: 无法连接 NetNewsWire。

# homescreen.action.add-feed
source: Add Feed
es: Añadir fuente
zh_hans: 添加订阅

# homescreen.action.first-unread
source: First Unread
es: Primero no leído
zh_hans: 第一个未读

# homescreen.action.search
source: Search
es: Buscar
zh_hans: 搜索

# keyboard.command.article-search
source: Article Search
es: Búsqueda de artículo
zh_hans: 搜索文章

# keyboard.command.clean-up
source: Clean Up
es: Limpiar
zh_hans: 清理

# keyboard.command.find-in-article
source: Find in Article
es: Buscar en artículo
zh_hans: 在文章中查找

# keyboard.command.get-feed-info
source: Get Feed Info
es: Obtener información de fuente
zh_hans: 获取订阅信息

# keyboard.command.go-to-all-unread
source: Go To All Unread
es: Ir a todos los no leídos
zh_hans: 前往 所有未读

# keyboard.command.go-to-settings
source: Go To Settings
es: Ir a ajustes
zh_hans: 前往 设置

# keyboard.command.go-to-starred
source: Go To Starred
es: Ir a favoritos
zh_hans: 前往 星标

# keyboard.command.go-to-today
source: Go To Today
es: Ir a hoy
zh_hans: 前往 今日

# keyboard.command.mark-above-as-read
source: Mark Above as Read
es: Marcar anteriores como leídos
zh_hans: 将上方文章标为已读

# keyboard.command.mark-all-as-read
source: Mark All as Read
es: Marcar todo como leído
zh_hans: 全部标为已读

# keyboard.command.mark-below-as-read
source: Mark Below as Read
es: Marcar siguientes como leídos
zh_hans: 将下方文章标为已读

# keyboard.command.new-folder
source: New Folder
es: Nueva carpeta
zh_hans: 新建文件夹

# keyboard.command.new-web-feed
source: New Web Feed
es: Nueva fuente
zh_hans: 添加 Web 订阅

# keyboard.command.next-unread
source: Next Unread
es: Siguiente no leído
zh_hans: 下一个未读

# keyboard.command.open-in-browser
source: Open In Browser
es: Abrir en navegador
zh_hans: 在浏览器中打开

# keyboard.command.refresh
source: Refresh
es: Refrescar
zh_hans: 刷新

# keyboard.command.select-next-down
source: Select Next Down
es: Seleccionar siguiente abajo
zh_hans: 选择下一个

# keyboard.command.select-next-up
source: Select Next Up
es: Seleccionar siguiente arriba
zh_hans: 选择上一个

# keyboard.command.toggle-read-articles-filter
source: Toggle Read Articles Filter
es: Activar filtro de artículos leídos
zh_hans: 切换已读文章过滤器

# keyboard.command.toggle-read-feeds-filter
source: Toggle Read Feeds Filter
es: Activar filtro de fuentes leídas
zh_hans: 切换已读订阅过滤器

# keyboard.command.toggle-read-status
source: Toggle Read Status
es: Activar estado de lectura
zh_hans: 切换已读状态

# keyboard.command.toggle-reader-view
source: Toggle Reader View
es: Activar vista de lectura
zh_hans: 切换阅读器视图

# keyboard.command.toggle-sidebar
source: Toggle Sidebar
es: Activar barra lateral
zh_hans: 显示/折叠边栏

# keyboard.command.toggle-starred-status
source: Toggle Starred Status
es: Activar estado de favorito
zh_hans: 切换星标状态

# label.accessibility.collapse-folder
source: Collapse Folder
es: Colapsar carpeta
zh_hans: 折叠文件夹

# label.accessibility.collapsed
source: Collapsed
es: Colapsar
zh_hans: 已折叠

# label.accessibility.expand-folder
source: Expand Folder
es: Expandir carpeta
zh_hans: 已展开文件夹

# label.accessibility.expanded
source: Expanded
es: Expandir
zh_hans: 已展开

# label.accessibility.filter-read-artciles
source: Filter Read Articles
es: Filtrar artículos leídos
zh_hans: 过滤已读文章

# label.accessibility.selected-filter-read-artciles
source: Selected - Filter Read Articles
es: Seleccionado - Filtrar artículos leídos
zh_hans: 已选择 - 过滤已读文章

# label.accessibility.unread
source: Unread
es: No leídos
zh_hans: 未读

# label.placeholder.feed-name
source: Feed name
zh_hans: 订阅名称

# label.search-results.%i.%i
source: %1$i of %2$i
es: %1$i de %2$i
zh_hans: %1$i/%2$i

# label.text.account-and-extensions-explainer
source: Add, delete, enable, or disable accounts and extensions.
es: Añadir, borrar, activar o desactivar cuentas y extensiones.
zh_hans: 添加、删除、启用或禁用账户和扩展。

# label.text.accounts-and-extensions
source: Account & Extensions
es: Cuenta y extensiones
zh_hans: 账户 & 扩展

# label.text.active-accounts
source: Active Account
es: Activar cuenta
zh_hans: 活跃账户

# label.text.active-extensions
source: Active Extensions
es: Activar extensiones
zh_hans: 活跃扩展

# label.text.additional-contributors
source: Additional Contributors
es: Colaboradores adicionales
zh_hans: 其他贡献者

# label.text.appearance
source: Appearance
es: Aspecto
zh_hans: 外观

# label.text.appearance-explainer
source: Manage the look, feel, and behavior of NetNewsWire.
es: Gestiona el estilo y comportamiento de NetNewsWire.
zh_hans: 管理 NetNewsWire 的外观和体验

# label.text.application
source: Application
es: Aplicación
zh_hans: 应用

# label.text.articles
source: Articles
es: Artículos
zh_hans: 文章

# label.text.bazqux-explainer
source: Sign in to your BazQux account and sync your feeds across your devices. Your username and password will be encrypted and stored in Keychain. Don’t have a BazQux account? [Sign Up Here](https://bazqux.com)
es: Inicia sesión en tu cuenta BazQux y sincroniza tus fuentes en tus dispositivos. Tu nombre de usuario y contraseña serán cifrados y guardados en el Llavero. ¿No tienes una cuenta BazQux? [Regístrate aquí](https://bazqux.com)
zh_hans: 登录你的 BazQux 帐户以在设备间同步你的订阅。你的用户名和密码将被加密并存储在钥匙串中。 还没有 BazQux 账户？ [在这里注册](https://bazqux.com)

# label.text.cloudkit-account-footer
source: Your iCloud account syncs your feeds across your Mac and iOS devices
es: Tu cuenta iCloud sincroniza tus fuentes en tu Mac y tus dispositivos iOS
zh_hans: 你的 iCloud 帐户将在 Mac 和 iOS 设备之间同步你的订阅。

# label.text.cloudkit-explainer
source: NetNewsWire will use your iCloud account to sync your subscriptions across your Mac and iOS devices.
es: NetNewsWire usará tu cuenta iCloud para sincronizar tus suscripciones en tu Mac y tus dispositivos iOS.
zh_hans: NetNewsWire 将使用你的 iCloud 帐户在 Mac 和 iOS 设备间同步你的订阅。

# label.text.default-themes
source: Default Themes
es: Temas por defecto
zh_hans: 默认主题

# label.text.default-themes-explainer
source: These themes cannot be deleted.
es: Estos temas no pueden ser borrados.
zh_hans: 这些主题无法删除。

# label.text.device-permissions
source: Device Permissions
es: Permisos del dispositivo
zh_hans: 设备权限

# label.text.device-permissions-explainer
source: Configure NetNewsWire's access to Siri, background app refresh, mobile data, and more.
es: Configura el acceso de NetNewsWire a Siri, el refresco en segundo plano, datos móviles y más.
zh_hans: 配置 NetNewsWire 对 Siri、后台应用刷新、移动数据等的访问权限。

# label.text.feed-providers
source: Feed Providers
es: Proveedores de fuentes
zh_hans: 订阅服务提供商

# label.text.feed-providers-explainer
source: Feed Providers allow you to subscribe to some pages as if they were RSS feeds.
es: Los proveedores de fuentes te permiten suscribirte a algunas páginas como si tuviesen una fuente RSS.
zh_hans: 订阅服务提供商允许你像订阅 RSS 一样订阅某些页面

# label.text.feed-url
source: Feed URL
es: URL de la fuente
zh_hans: 订阅源 URL

# label.text.feedbin-explainer
source: Sign in to your Feedbin account and sync your feeds across your devices. Your username and password will be encrypted and stored in Keychain. Don’t have a Feedbin account? [Sign Up Here](https://feedbin.com/signup)
zh_hans: 登录你的 Feedbin 帐户以在设备间同步你的订阅。你的用户名和密码将被加密并存储在钥匙串中。 还没有 Feedbin 账户？ [在这里注册](https://feedbin.com/signup)

# label.text.freshrss-explainer
source: Sign in to your FreshRSS instance and sync your feeds across your devices. Your username and password will be encrypted and stored in Keychain. Don’t have an FreshRSS instance? [Sign Up Here](https://freshrss.org)
es: Inicia sesión en tu cuenta FreshRSS y sincroniza tus fuentes en tus dispositivos. Tu nombre de usuario y contraseña serán cifrados y guardados en el Llavero. ¿No tienes una cuenta FreshRSS? [Regístrate aquí](https://freshrss.org)
zh_hans: 登录你的 FreshRSS 帐户以在设备间同步你的订阅。你的用户名和密码将被加密并存储在钥匙串中。 还没有 FreshRSS 账户？ [在这里注册](https://freshrss.org)

# label.text.home-page
source: Home Page
es: Página de inicio
zh_hans: 主页

# label.text.icon-size
source: Icon Size
es: Tamaño del icono
zh_hans: 图标大小

# label.text.inactive-accounts
source: Inactive Account
es: Cuenta inactiva
zh_hans: 不活跃账户

# label.text.inoreader-explainer
source: Sign in to your InoReader account and sync your feeds across your devices. Your username and password will be encrypted and stored in Keychain. Don’t have an InoReader account? [Sign Up Here](https://www.inoreader.com)
es: Inicia sesión en tu cuenta InoReader y sincroniza tus fuentes en tus dispositivos. Tu nombre de usuario y contraseña serán cifrados y guardados en el Llavero. ¿No tienes una cuenta InoReader? [Regístrate aquí](https://www.inoreader.com)
zh_hans: 登录你的 InoReader 帐户以在设备间同步你的订阅。你的用户名和密码将被加密并存储在钥匙串中。 还没有 InoReader 账户？ [在这里注册](https://www.inoreader.com)

# label.text.local-account
source: Local Account
es: Cuenta local
zh_hans: 本地账户

# label.text.local-account-explainer
source: Local accounts do not sync your feeds across devices
es: Las cuentas locales no sincronizan las fuentes en tus dispositivos
zh_hans: 本地账户不会在设备间同步你的订阅。

# label.text.netnewswire-byline
source: By Brent Simmons and the Ranchero Software team.
es: Por Brent Simmons y el equipo de Ranchero Software.
zh_hans: 由 Brent Simmons 和 Ranchero Software 团队开发。

# label.text.newsblur-explainer
source: Sign in to your NewsBlur account and sync your feeds across your devices. Your username and password will be encrypted and stored in Keychain. Don’t have a NewsBlur account? [Sign Up Here](https://newsblur.com)
es: Inicia sesión en tu cuenta NewsBlur y sincroniza tus fuentes en tus dispositivos. Tu nombre de usuario y contraseña serán cifrados y guardados en el Llavero. ¿No tienes una cuenta NewsBlur? [Regístrate aquí](https://newsblur.com)
zh_hans: 登录你的 NewsBlur 帐户以在设备间同步你的订阅。你的用户名和密码将被加密并存储在钥匙串中。 还没有 NewsBlur 账户？ [在这里注册](https://newsblur.com)

# label.text.no-results
source: No results
es: No hay resultados
zh_hans: 无结果

# label.text.no-text
source: (No Text)
es: (Sin texto)
zh_hans: （无文本）

# label.text.number-of-lines
source: Number of Lines
es: Número de líneas
zh_hans: 行数

# label.text.primary-contributors
source: Primary Contributors
es: Colaboradores principales
zh_hans: 主要贡献者

# label.text.self-hosted-accounts
source: Self-Hosted Accounts
es: Alojamiento propio
zh_hans: 自托管账户
