Repository: Ranchero-Software/NetNewsWire
Catalog: iOS/Resources/*.lproj/Localizable.strings
Languages: es, zh_hans

# label.text.self-hosted-accounts-explainer
source: Self-hosted accounts sync your feeds across all your devices
es: Las cuentas con alojamiento propio sincronizan tus fuentes en todos tus dispositivos
zh_hans: 自托管帐户可以在所有设备上同步你的订阅。

# label.text.thanks
source: Thanks
es: Gracias
zh_hans: 鸣谢

# label.text.theme-created-byline.%@
source: Created by %@
es: Creado por %@
zh_hans: 由 %@ 创建

# label.text.theoldreader-explainer
source: Sign in to your The Old Reader account and sync your feeds across your devices. Your username and password will be encrypted and stored in Keychain. Don’t have a The Old Reader account? [Sign Up Here](https://theoldreader.com)
es: Inicia sesión en tu cuenta The Old Reader y sincroniza tus fuentes en tus dispositivos. Tu nombre de usuario y contraseña serán cifrados y guardados en el Llavero. ¿No tienes una cuenta The Old Reader? [Regístrate aquí](https://theoldreader.com)
zh_hans: 登录你的 The Old Reader 帐户以在设备间同步你的订阅。你的用户名和密码将被加密并存储在钥匙串中。 还没有 The Old Reader 帐户？ [在这里注册](https://theoldreader.com)

# label.text.third-party-themes
source: Third Party Themes
es: Temas de terceros
zh_hans: 第三方主题

# label.text.timeline
source: Timeline
es: Línea de tiempo
zh_hans: 时间线

# label.text.updatedat.%@
source: Updated %@
es: Actualizado %@
zh_hans: 更新于 %@

# label.text.updatednow
source: Updated Just Now
es: Actualizado justo ahora
zh_hans: 刚刚更新

# label.text.use-dark-appearance
source: Always Dark
es: Siempre oscuro
zh_hans: 总是保持深色

# label.text.use-device-appearance
source: Use Device
es: Automático
zh_hans: 和设备同步

# label.text.use-light-appearance
source: Always Light
es: Siempre claro
zh_hans: 总是保持浅色

# label.text.web-account
source: Web Account
es: Cuenta web
zh_hans: Web 账户

# label.text.web-account-explainer
source: Web accounts sync your feeds across all your devices
es: Las cuentas web sincronizan tus fuentes en todos tus dispositivos
zh_hans: Web 账户会将你的订阅在所有设备间同步

# link.markdown.icloud-limitations
source: [iCloud Syncing Limitations & Solutions](https://netnewswire.com/help/iCloud)
es: [Sincronización con iCloud: limitaciones y soluciones](https://netnewswire.com/help/iCloud)
zh_hans: [iCloud 同步限制 & 解决方案](https://netnewswire.com/help/iCloud)

# menu.title.articleappearance
source: Article Appearance
zh_hans: 文章样式

# navigation.title.about
source: About
es: Acerca de
zh_hans: 关于

# navigation.title.add-account
source: Add Account
es: Añadir cuenta
zh_hans: 添加账户

# navigation.title.add-extensions
source: Add Extensions
es: Añadir extensiones
zh_hans: 添加扩展

# navigation.title.add-reddit-feed
source: Add Reddit Feed
zh_hans: 添加 Reddit 订阅

# navigation.title.add-twitter-feed
source: Add Twitter Feed
zh_hans: 添加 Twitter 订阅

# navigation.title.article-themes
source: Article Themes
es: Temas de artículo
zh_hans: 文章主题

# navigation.title.display-and-behaviors
source: Display & Behaviors
zh_hans: 显示和体验

# navigation.title.enter-name
source: Enter Name
es: Introducir nombre
zh_hans: 输入名称

# navigation.title.manage-accounts
source: Manage Accounts
es: Gestionar cuentas
zh_hans: 管理账户

# navigation.title.manage-extensions
source: Manage Extensions
es: Gestionar extensiones
zh_hans: 管理扩展

# navigation.title.new-article-notifications
source: New Article Notifications
es: Notificaciones de nuevos artículos
zh_hans: 新文章通知

# navigation.title.settings
source: Settings
es: Ajustes
zh_hans: 设置

# navigation.title.timeline-layout
source: Timeline Layout
es: Disposición de línea de tiempo
zh_hans: 时间线布局

# searchbar.placeholder.searcharticles
source: Search Articles
es: Buscar artículos
zh_hans: 搜索文章

# searchbar.scope.allarticles
source: All Articles
es: Todos los artículos
zh_hans: 全部文章

# searchbar.scope.here
source: Here
es: Aquí
zh_hans: 仅当前订阅

# smartfeed.title.allunread
source: All Unread
es: No leídos
zh_hans: 所有未读

# smartfeed.title.starred
source: Starred
es: Favoritos
zh_hans: 星标

# smartfeed.title.today
source: Today
es: Hoy
zh_hans: 今日

# smartfeeds.title
source: Smart Feeds
es: Fuentes inteligentes
zh_hans: 智能订阅

# textfield.placeholder.email-address
source: Email Address
es: Email
zh_hans: 电子邮箱地址

# textfield.placeholder.name
source: Name
es: Nombre
zh_hans: 名称

# textfield.placeholder.password
source: Password
es: Contraseña
zh_hans: 密码

# textfield.placeholder.screen-name
source: Screen Name
es: Nombre de pantalla
zh_hans: 显示名称

# textfield.placeholder.search-term-hashtag
source: Search Term or #hashtag
es: Término de búsqueda o #hashtag
zh_hans: 搜索词语或者 #标签

# textfield.placeholder.username
source: Username
es: Nombre de usuario
zh_hans: 用户名

# textfield.placeholder.username-or-email
source: Username or Email
es: Nombre de usuario o email
zh_hans: 用户名或邮箱

# toggle.account.active
source: Active
es: Activo
zh_hans: 活跃

# toggle.title.always-show-reader-view
source: Always Show Reader View
es: Siempre mostrar vista de lectura
zh_hans: 始终显示阅读器视图

# toggle.title.confirm-mark-all-as-read
source: Confirm Mark All as Read
es: Confirmar marcar todo como leído
zh_hans: 确认全部标为已读

# toggle.title.group-by-feed
source: Group by Feed
es: Agrupar por fuente
zh_hans: 按订阅源分组

# toggle.title.notify-about-new-articles
source: New Article Notifications
es: Notificaciones de nuevos artículos
zh_hans: 新文章通知

# toggle.title.open-links-in-netnewswire
source: Open Links in NetNewsWire
es: Abrir enlaces en NetNewsWire
zh_hans: 在 NetNewsWire 中打开链接

# toggle.title.refresh-to-clear-articles
source: Refresh to Clear Articles
es: Refrescar para borrar artículos
zh_hans: 刷新后清除文章

# toggle.title.sort-oldest-to-newest
source: Sort Oldest to Newest
es: Ordenar más antiguos a nuevos
zh_hans: 按从老到新排序
